import random

field = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]

# возвращает массив из двух элементов
# [x, y] - координаты, куда надо выстрелить (от 0 до 9)
def shoot():
    x = random.randint(0, 9)
    y = random.randint(0, 9)
    return [x, y]

# наблюдает результат последнего выстрела
# kill принимает значения True/False
def observe(x, y, kill):
    if kill:
        field[x][y] = 1
